# все глобальные переменные, константы и значения для работы бота

# --------------------------------------------------------------------------------
flag_repository = False  # True если нужно запустить под виндой (файлы должны быть в одном каталоге)
flag_hello_message = False  # нужно ли прислать приветственное сообщение при запуске на сервере
flag_smile = False  # нужно ли использовать перевод символов цифр в жирный шрифт юникода

# --------------------------------------------------------------------------------
smile_1 = {"1": "𝟭", "2": "𝟮", "3": "𝟯", "4": "𝟰", "5": "𝟱", "6": "𝟲", "7": "𝟳", "8": "𝟴", "9": "𝟵", "0": "𝟬"}
smile_2 = {"1": "1", "2": "2", "3": "3", "4": "4", "5": "5", "6": "6", "7": "7", "8": "8", "9": "9", "0": "0"}

# --------------------------------------------------------------------------------
list_answer_300 = ["Отсоси у программиста!", "Отсоси у тракториста!", "Отвези домой таксиста!",
                   "Сам тащи рюкзак туриста", "Лизни подмышку пианиста"]
list_answer_no = ["Пидора ответ!", "Программиста ответ!", "Петика ответ!"]
list_laziness = ['лень', 'лениво', 'учиться', 'ботать']
list_pnct_marks = [".", ",", "!", "?", ")", "(", ":", ";", "'", ']', '[', '"']
list_like_you = ["пидр", "сука", "лох", "пидрила", "мудак", "дурак", "тупой", "тормоз", "дебил", "дибил", "дурачок"]
list_eat = ["кушать", "пить", "есть", "поесть", "жрать", "покушать"]
list_going = ['хочешь', 'будем', 'будешь', 'пошли', 'где', 'го', 'погнали', 'куда', 'гоу']
list_name = ["вик", "ксюх", "ксюш", "ксень", "саш", "сань", "петь", "петя", "петро", "кать",
             "катя", "катюх", "андрей", "андрюх", "оля", "оль", "ник"]
dict_month = {'January': 1, 'February': 2, 'March': 3, 'April': 4, 'May': 5, 'June': 6, 'July': 7, 'August': 8,
              'September': 9, 'October': 10, 'November': 11, 'December': 12}
im_text = {'Переменная облачность': '⛅', 'Облачно с прояснениями': '⛅', 'Небольшая облачность': '⛅',
           'Сплошная облачность': '☁', 'Ясно': '☀'}
im_text_2 = {'дождь': '💧', 'снег': '❄'}
spisok_znakov = ['aries', 'taurus', 'gemini', 'cancer', 'leo', 'virgo', 'libra', 'scorpio', 'sagittarius',
                     'capricorn', 'aquarius', 'pisces']

# --------------------------------------------------------------------------------
message_help_1 = 'Привет! В Беседах мне доступны следующие функции:\n1) !погода\n2) !погода в городе ...\n\
                3) !погода на завтра в городе ...\n4) !погода на завтра\n5) !кубик ...\n6) !гороскоп\n\
                7) !анекдот\n8) !цитата\n9) !факт\n10) !мысль\n11) !пидор дня\n12) !пидоры\n\
                13) !отстань, !отъебись, !вернись\n14) !крокодил\n15) !крокодил стата\n\
                Остальное время я буду просто реагировать на некоторые контекстные фразы'
message_help_2 = 'Привет! В Беседах мне доступны следующие функции:\n1) !погода\n2) !погода в городе ...\n\
                3) !погода на завтра в городе ...\n4) !погода на завтра\n5) !кубик ...\n6) !гороскоп\n\
                7) !анекдот\n8) !цитата\n9) !факт\n10) !мысль\n11) !купи слона\n12) !крокодил\n13) !крокодил стата\n\
                Остальное время я буду просто реагировать на некоторые контекстные фразы'

# --------------------------------------------------------------------------------
spisok_chata = {195310233: "Никита Михайлов", 38375746: "Антон Фокин", 120727528: "Ольга Меркулова", 51556033:"Петр Евдокимов",
                  13069991: "Андрей Петранов", 20765196: "Катя Евдокимова", 109828457: "Александр Маслов", 206947265: "Fidl Di-Di",
                  12403758: "Вика Карпеева", 135053737: "Анастасия Живых", 36611284: "Андрей Коваленко"}
